examples/medical_build/openfoam_case/system/controlDict.pimpleFoam
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}
application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.10;
deltaT          1e-4;
writeControl    timeStep;
writeInterval   100;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
maxCo           0.5;
