examples/medical_build/openfoam_case/system/snappyHexMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }
castellatedMesh true; snap true; addLayers false;
geometry { aorta_surface { type triSurfaceMesh; file "aorta_multiregion.stl"; } }
castellatedMeshControls { maxLocalCells 100000; maxGlobalCells 500000; minRefinementCells 10; maxLoadUnbalance 0.10; nCellsBetweenLevels 2; features (); refinementSurfaces { aorta_surface { level (2 3); regions { inlet { level (3 3); patchInfo { type patch; } } outlet_0 { level (3 3); patchInfo { type patch; } } outlet_1 { level (3 3); patchInfo { type patch; } } outlet_2 { level (3 3); patchInfo { type patch; } } outlet_3 { level (3 3); patchInfo { type patch; } } outlet_5 { level (3 3); patchInfo { type patch; } } outlet_6 { level (3 3); patchInfo { type patch; } } outlet_7 { level (3 3); patchInfo { type patch; } } outlet_8 { level (3 3); patchInfo { type patch; } } wall { level (2 2); patchInfo { type wall; } } } } } resolveFeatureAngle 30; refinementRegions {}; locationInMesh (-100 100 25); allowFreeStandingZoneFaces true; }
snapControls { nSmoothPatch 3; tolerance 2.0; nSolveIter 30; nRelaxIter 5; nFeatureSnapIter 10; implicitFeatureSnap false; explicitFeatureSnap true; multiRegionFeatureSnap false; }
addLayersControls { relativeSizes true; layers {}; }
meshQualityControls { maxNonOrtho 70; maxBoundarySkewness 20; maxInternalSkewness 4; maxConcave 80; minVol 1e-13; minTetQuality 1e-9; minArea -1; minTwist 0.02; minDeterminant 0.001; minFaceWeight 0.02; minVolRatio 0.01; minTriangleTwist -1; errorReduction 0.75; nSmoothScale 4; }
debug 0; mergeTolerance 1e-6;
