examples/medical_build/openfoam_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

 dimensions      [0 1 -1 0 0 0 0];
 internalField   uniform (0 0 0);
 boundaryField
 {
     outer
     {
         type            zeroGradient;
     }
     aorta_surface_inlet
     {
         type            flowRateInletVelocity;
         volumetricFlowRate constant 3.0e-6;
         value           uniform (0 0 0);
     }
     aorta_surface_outlet_0
     {
         type            pressureInletOutletVelocity;
         value           uniform (0 0 0);
     }
     aorta_surface_outlet_1
     {
         type            pressureInletOutletVelocity;
         value           uniform (0 0 0);
     }
     aorta_surface_outlet_2
     {
         type            pressureInletOutletVelocity;
         value           uniform (0 0 0);
     }
     aorta_surface_outlet_3
     {
         type            pressureInletOutletVelocity;
         value           uniform (0 0 0);
     }
     aorta_surface_outlet_5
     {
         type            pressureInletOutletVelocity;
         value           uniform (0 0 0);
     }
     aorta_surface_outlet_6
     {
         type            pressureInletOutletVelocity;
         value           uniform (0 0 0);
     }
     aorta_surface_outlet_7
     {
         type            pressureInletOutletVelocity;
         value           uniform (0 0 0);
     }
     aorta_surface_outlet_8
     {
         type            pressureInletOutletVelocity;
         value           uniform (0 0 0);
     }
     aorta_surface_wall
     {
         type            noSlip;
     }
 }
