examples/medical_build/openfoam_case/system/surfaceFeatureExtractDict
FoamFile{version 2.0; format ascii; class dictionary; object surfaceFeatureExtractDict;}
aorta_surface.stl{extractionMethod extractFromSurface; extractFromSurfaceCoeffs{includedAngle 150;}}
